{
  "$schema": "https://schema.management.azure.com/schemas/2015-01-01/deploymentParameters.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "alertName": {
      "value": "CreateUpdate-SQL-DB"
    },
    "alertLocation": {
      "value": "eastus 2"
    },
    "isEnabled": {
      "value": true
    },
    "kqlAlertQuery": {
      "value": "AzureActivity | where CategoryValue == 'Administrative' and OperationNameValue == 'MICROSOFT.SQL/SERVERS/DATABASES/FAILOVER/ACTION'"
    },
    "centralizedActivitylogWorkspace": {
      "value": null
    },
    "frequencyInMinutes": {
      "value": 5
    },
    "timeWindowInMinutes": {
      "value": 60
    },
    "alertSeverity": {
      "value": 0
    },
    "actionGroupId": {
      "value": null
    },
    "throttlingInMin": {
      "value": 60
    }
  }
}